# NodeType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalAnalyticalNode..::..NodeType Property
ElectricalAnalyticalNode Class See Also
---
The type of electrical analytical node.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ElectricalAnalyticalNodeType NodeType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NodeType As ElectricalAnalyticalNodeType
	Get
```

Visual C++
---
```text
public:
property ElectricalAnalyticalNodeType NodeType {
	ElectricalAnalyticalNodeType get ();
}
```

# See Also
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace